IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28004x_mem_cfg_regs.xml
<module id="MEM_CFG_REGS" HW_revision="" description="MEM CFG Registers">
	<register id="DxLOCK" width="32" page="1" offset="0x0" internal="0" description="Dedicated RAM Config Lock Register">
		<bitfield id="LOCK_M0" description="M0 RAM Lock bits" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_M1" description="M1 RAM Lock bits" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="DxCOMMIT" width="32" page="1" offset="0x2" internal="0" description="Dedicated RAM Config Lock Commit Register">
		<bitfield id="COMMIT_M0" description="M0 RAM Permanent Lock bits" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_M1" description="M1 RAM Permanent Lock bits" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="DxACCPROT0" width="32" page="1" offset="0x8" internal="0" description="Dedicated RAM Config Register">
	</register>
	<register id="DxTEST" width="32" page="1" offset="0x10" internal="0" description="Dedicated RAM TEST Register">
		<bitfield id="TEST_M0" description="Selects the different modes for M0 RAM" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="TEST_M1" description="Selects the different modes for M1 RAM" begin="3" end="2" width="2" rwaccess="RW"/>
	</register>
	<register id="DxINIT" width="32" page="1" offset="0x12" internal="0" description="Dedicated RAM Init Register">
		<bitfield id="INIT_M0" description="RAM Initialization control for M0 RAM." begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INIT_M1" description="RAM Initialization control for M1 RAM." begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="DxINITDONE" width="32" page="1" offset="0x14" internal="0" description="Dedicated RAM InitDone Status Register">
		<bitfield id="INITDONE_M0" description="RAM Initialization status for M0 RAM." begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_M1" description="RAM Initialization status for M1 RAM." begin="1" end="1" width="1" rwaccess="R"/>
	</register>
	<register id="LSxLOCK" width="32" page="1" offset="0x20" internal="0" description="Local Shared RAM Config Lock Register">
		<bitfield id="LOCK_LS0" description="LS0 RAM Lock bits" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_LS1" description="LS1 RAM Lock bits" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_LS2" description="LS2 RAM Lock bits" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_LS3" description="LS3 RAM Lock bits" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_LS4" description="LS4 RAM Lock bits" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_LS5" description="LS5 RAM Lock bits" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_LS6" description="LS6 RAM Lock bits" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_LS7" description="LS7 RAM Lock bits" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="LSxCOMMIT" width="32" page="1" offset="0x22" internal="0" description="Local Shared RAM Config Lock Commit Register">
		<bitfield id="COMMIT_LS0" description="LS0 RAM Permanent Lock bits" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_LS1" description="LS1 RAM Permanent Lock bits" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_LS2" description="LS2 RAM Permanent Lock bits" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_LS3" description="LS3 RAM Permanent Lock bits" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_LS4" description="LS4 RAM Permanent Lock bits" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_LS5" description="LS5 RAM Permanent Lock bits" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_LS6" description="LS6 RAM Permanent Lock bits" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_LS7" description="LS7 RAM Permanent Lock bits" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="LSxMSEL" width="32" page="1" offset="0x24" internal="0" description="Local Shared RAM Master Sel Register">
		<bitfield id="MSEL_LS0" description="Master Select for LS0 RAM" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="MSEL_LS1" description="Master Select for LS1 RAM" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="MSEL_LS2" description="Master Select for LS2 RAM" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="MSEL_LS3" description="Master Select for LS3 RAM" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="MSEL_LS4" description="Master Select for LS4 RAM" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="MSEL_LS5" description="Master Select for LS5 RAM" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="MSEL_LS6" description="Master Select for LS6 RAM" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="MSEL_LS7" description="Master Select for LS7 RAM" begin="15" end="14" width="2" rwaccess="RW"/>
	</register>
	<register id="LSxCLAPGM" width="32" page="1" offset="0x26" internal="0" description="Local Shared RAM Prog/Exe control Register">
		<bitfield id="CLAPGM_LS0" description="Selects LS0 RAM as program vs data memory for CLA" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CLAPGM_LS1" description="Selects LS1 RAM as program vs data memory for CLA" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CLAPGM_LS2" description="Selects LS2 RAM as program vs data memory for CLA" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CLAPGM_LS3" description="Selects LS3 RAM as program vs data memory for CLA" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CLAPGM_LS4" description="Selects LS4 RAM as program vs data memory for CLA" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CLAPGM_LS5" description="Selects LS5 RAM as program vs data memory for CLA" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CLAPGM_LS6" description="Selects LS6 RAM as program vs data memory for CLA" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CLAPGM_LS7" description="Selects LS7 RAM as program vs data memory for CLA" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="LSxACCPROT0" width="32" page="1" offset="0x28" internal="0" description="Local Shared RAM Config Register 0">
		<bitfield id="FETCHPROT_LS0" description="Fetch Protection For LS0 RAM" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_LS0" description="CPU WR Protection For LS0 RAM" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="FETCHPROT_LS1" description="Fetch Protection For LS1 RAM" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_LS1" description="CPU WR Protection For LS1 RAM" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="FETCHPROT_LS2" description="Fetch Protection For LS2 RAM" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_LS2" description="CPU WR Protection For LS2 RAM" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="FETCHPROT_LS3" description="Fetch Protection For LS3 RAM" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_LS3" description="CPU WR Protection For LS3 RAM" begin="25" end="25" width="1" rwaccess="RW"/>
	</register>
	<register id="LSxACCPROT1" width="32" page="1" offset="0x2a" internal="0" description="Local Shared RAM Config Register 1">
		<bitfield id="FETCHPROT_LS4" description="Fetch Protection For LS4 RAM" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_LS4" description="CPU WR Protection For LS4 RAM" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="FETCHPROT_LS5" description="Fetch Protection For LS5 RAM" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_LS5" description="CPU WR Protection For LS5 RAM" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="FETCHPROT_LS6" description="Fetch Protection For LS6 RAM" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_LS6" description="CPU WR Protection For LS6 RAM" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="FETCHPROT_LS7" description="Fetch Protection For LS7 RAM" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_LS7" description="CPU WR Protection For LS7 RAM" begin="25" end="25" width="1" rwaccess="RW"/>
	</register>
	<register id="LSxTEST" width="32" page="1" offset="0x30" internal="0" description="Local Shared RAM TEST Register">
		<bitfield id="TEST_LS0" description="Selects the different modes for LS0 RAM" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="TEST_LS1" description="Selects the different modes for LS1 RAM" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="TEST_LS2" description="Selects the different modes for LS2 RAM" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="TEST_LS3" description="Selects the different modes for LS3 RAM" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="TEST_LS4" description="Selects the different modes for LS4 RAM" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="TEST_LS5" description="Selects the different modes for LS5 RAM" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="TEST_LS6" description="Selects the different modes for LS6 RAM" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="TEST_LS7" description="Selects the different modes for LS7 RAM" begin="15" end="14" width="2" rwaccess="RW"/>
	</register>
	<register id="LSxINIT" width="32" page="1" offset="0x32" internal="0" description="Local Shared RAM Init Register">
		<bitfield id="INIT_LS0" description="RAM Initialization control for LS0 RAM." begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INIT_LS1" description="RAM Initialization control for LS1 RAM." begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INIT_LS2" description="RAM Initialization control for LS2 RAM." begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INIT_LS3" description="RAM Initialization control for LS3 RAM." begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INIT_LS4" description="RAM Initialization control for LS4 RAM." begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INIT_LS5" description="RAM Initialization control for LS5 RAM." begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INIT_LS6" description="RAM Initialization control for LS6 RAM." begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INIT_LS7" description="RAM Initialization control for LS7 RAM." begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="LSxINITDONE" width="32" page="1" offset="0x34" internal="0" description="Local Shared RAM InitDone Status Register">
		<bitfield id="INITDONE_LS0" description="RAM Initialization status for LS0 RAM." begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_LS1" description="RAM Initialization status for LS1 RAM." begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_LS2" description="RAM Initialization status for LS2 RAM." begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_LS3" description="RAM Initialization status for LS3 RAM." begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_LS4" description="RAM Initialization status for LS4 RAM." begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_LS5" description="RAM Initialization status for LS5 RAM." begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_LS6" description="RAM Initialization status for LS6 RAM." begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_LS7" description="RAM Initialization status for LS7 RAM." begin="7" end="7" width="1" rwaccess="R"/>
	</register>
	<register id="GSxLOCK" width="32" page="1" offset="0x40" internal="0" description="Global Shared RAM Config Lock Register">
		<bitfield id="LOCK_GS0" description="GS0 RAM Lock bits" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_GS1" description="GS1 RAM Lock bits" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_GS2" description="GS2 RAM Lock bits" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_GS3" description="GS3 RAM Lock bits" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="GSxCOMMIT" width="32" page="1" offset="0x42" internal="0" description="Global Shared RAM Config Lock Commit Register">
		<bitfield id="COMMIT_GS0" description="GS0 RAM Permanent Lock bits" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_GS1" description="GS1 RAM Permanent Lock bits" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_GS2" description="GS2 RAM Permanent Lock bits" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_GS3" description="GS3 RAM Permanent Lock bits" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="GSxACCPROT0" width="32" page="1" offset="0x48" internal="0" description="Global Shared RAM Config Register 0">
		<bitfield id="FETCHPROT_GS0" description="Fetch Protection For GS0 RAM" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_GS0" description="CPU WR Protection For GS0 RAM" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="DMAWRPROT_GS0" description="DMA WR Protection For GS0 RAM" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="FETCHPROT_GS1" description="Fetch Protection For GS1 RAM" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_GS1" description="CPU WR Protection For GS1 RAM" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="DMAWRPROT_GS1" description="DMA WR Protection For GS1 RAM" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="FETCHPROT_GS2" description="Fetch Protection For GS2 RAM" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_GS2" description="CPU WR Protection For GS2 RAM" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="DMAWRPROT_GS2" description="DMA WR Protection For GS2 RAM" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="FETCHPROT_GS3" description="Fetch Protection For GS3 RAM" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_GS3" description="CPU WR Protection For GS3 RAM" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="DMAWRPROT_GS3" description="DMA WR Protection For GS3 RAM" begin="26" end="26" width="1" rwaccess="RW"/>
	</register>
	<register id="GSxACCPROT1" width="32" page="1" offset="0x4a" internal="0" description="Global Shared RAM Config Register 1">
	</register>
	<register id="GSxACCPROT2" width="32" page="1" offset="0x4c" internal="0" description="Global Shared RAM Config Register 2">
	</register>
	<register id="GSxACCPROT3" width="32" page="1" offset="0x4e" internal="0" description="Global Shared RAM Config Register 3">
	</register>
	<register id="GSxTEST" width="32" page="1" offset="0x50" internal="0" description="Global Shared RAM TEST Register">
		<bitfield id="TEST_GS0" description="Selects the different modes for GS0 RAM" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="TEST_GS1" description="Selects the different modes for GS1 RAM" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="TEST_GS2" description="Selects the different modes for GS2 RAM" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="TEST_GS3" description="Selects the different modes for GS3 RAM" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="GSxINIT" width="32" page="1" offset="0x52" internal="0" description="Global Shared RAM Init Register">
		<bitfield id="INIT_GS0" description="RAM Initialization control for GS0 RAM." begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INIT_GS1" description="RAM Initialization control for GS1 RAM." begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INIT_GS2" description="RAM Initialization control for GS2 RAM." begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INIT_GS3" description="RAM Initialization control for GS3 RAM." begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="GSxINITDONE" width="32" page="1" offset="0x54" internal="0" description="Global Shared RAM InitDone Status Register">
		<bitfield id="INITDONE_GS0" description="RAM Initialization status for GS0 RAM." begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_GS1" description="RAM Initialization status for GS1 RAM." begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_GS2" description="RAM Initialization status for GS2 RAM." begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_GS3" description="RAM Initialization status for GS3 RAM." begin="3" end="3" width="1" rwaccess="R"/>
	</register>
	<register id="MSGxLOCK" width="32" page="1" offset="0x60" internal="0" description="Message RAM Config Lock Register">
		<bitfield id="LOCK_CPUTOCLA1" description="CPUTOCLA1 RAM Lock bits" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_CLA1TOCPU" description="CLA1TOCPU RAM Lock bits" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="MSGxCOMMIT" width="32" page="1" offset="0x62" internal="0" description="Message RAM Config Lock Commit Register">
		<bitfield id="COMMIT_CPUTOCLA1" description="CPUTOCLA1 RAM control fields COMMIT bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_CLA1TOCPU" description="CLA1TOCPU RAM control fields COMMIT bit" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="MSGxTEST" width="32" page="1" offset="0x70" internal="0" description="Message RAM TEST Register">
		<bitfield id="TEST_CPUTOCLA1" description="CPU to CLA1 MSG RAM Mode Select" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="TEST_CLA1TOCPU" description="CLA1 to CPU MSG RAM Mode Select" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="MSGxINIT" width="32" page="1" offset="0x72" internal="0" description="Message RAM Init Register">
		<bitfield id="INIT_CPUTOCLA1" description="Initialization control for CPUTOCLA1 MSG RAM" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INIT_CLA1TOCPU" description="Initialization control for CLA1TOCPU MSG RAM" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="MSGxINITDONE" width="32" page="1" offset="0x74" internal="0" description="Message RAM InitDone Status Register">
		<bitfield id="INITDONE_CPUTOCLA1" description="Initialization status for CPU to CLA1 MSG RAM" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_CLA1TOCPU" description="Initialization status for CLA1 to CPU MSG RAM" begin="2" end="2" width="1" rwaccess="R"/>
	</register>
</module>
